IdeaRS.OpenModel.Concrete.CheckResult.ConcreteCheckDetailingEc2
Check Detailing Ec2

IdeaRS.OpenModel.Concrete.CheckResult.ConcreteCheckDetailingEc2.CheckValueLongReinf
check value of longitudinal reinforcement

IdeaRS.OpenModel.Concrete.CheckResult.ConcreteCheckDetailingEc2.CheckValueShearReinf
check value of shear  reinforcement